#!/bin/bash 

PS3="Выбирете куда хотете подключится или  Ctrl+C для отмены: "

username=zerg

connect() {
    ping -c 2 $1 >> /dev/null
    if [[ $? == 0 ]]; then
        echo -e "\e[32m SUCCESS ping to $1\e[0m"
    else
        echo -e "\e[33m FAILD ping to $1 \e[0m"
        exit 1
    fi 
    ssh $username@$1
}

declare -A targets=( 
    ['Питер']='192.168.136.99'
    ['Краснодар']='10.0.1.119'
    ['Ставрополь']='172.29.31.2'
    ['Архангельск']='10.4.0.99'
    ['ЛО']='172.23.38.20'
    ['Забайкалье']='10.2.255.100'
    ['Иркутск']='10.1.4.130'
    ['Мурманск']='10.30.10.125'
    ['Курск']='192.168.50.26'
    ['Хабаровск']='172.23.1.173'
    ['Кемерово']='192.168.42.150'
    ['Новгород']='192.53.244.169'
    ['Ростов']='10.61.0.49'
)

select target in "${!targets[@]}"; do connect ${targets[${target}]} ; done
